БПКР/src/InformationRegisters/СтавкиНалогаНаИмущество/СтавкиНалогаНаИмущество.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтавкиНалогаНаИмущество</name>
  <informationRegisterPeriodicity>Year</informationRegisterPeriodicity>
  <resources>
    <name>Ставка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ГруппаНалогаНаИмущество</name>
    <type>
      <types>CatalogRef.ГруппыИмущества</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БПКР/src/InformationRegisters/СтавкиНалогаНаИмущество/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура - Заполнить по умолчанию
// Выполняет первоночальное заполнение
Процедура ЗаполнитьПоУмолчанию() Экспорт
	СправочникМенеджер = Справочники.ГруппыИмущества;
	
	КлассификаторXML = РегистрыСведений.СтавкиНалогаНаИмущество.ПолучитьМакет("МакетЗаполнения").ПолучитьТекст();
	КлассификаторТаблица = ОбщегоНазначения.ПрочитатьXMLВТаблицу(КлассификаторXML).Данные;
	
	НаборЗаписей = РегистрыСведений.СтавкиНалогаНаИмущество.СоздатьНаборЗаписей();
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();                 
	
	Для Каждого СтрокаТаблицыЗначений Из КлассификаторТаблица Цикл
		Период = Дата(СокрЛП(СтрокаТаблицыЗначений.Период));
		Ставка   = Число(СокрЛП(СтрокаТаблицыЗначений.Ставка));
		ГруппаНалогаНаИмущество = СправочникМенеджер.НайтиПоКоду(СокрЛП(СтрокаТаблицыЗначений.Код));
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.ГруппаНалогаНаИмущество = ГруппаНалогаНаИмущество;
		НоваяЗапись.Период = Период;
		НоваяЗапись.Ставка   = Ставка;
	КонецЦикла;
	
	Попытка
		ОбновлениеИнформационнойБазы.ЗаписатьНаборЗаписей(НаборЗаписей);
	Исключение
	КонецПопытки;
КонецПроцедуры // ЗаполнитьПоУмолчанию()	

#КонецОбласти

#КонецЕсли
